# Import Libary numpy and pandas

In [1]:
import numpy as np 
import pandas as pd

# Data loading

#### Get Titanic dataset files

In [2]:
import os
for dirname, _, filenames in os.walk('/project/data'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

/project/data/.DS_Store
/project/data/gender_submission.csv
/project/data/test.csv
/project/data/train.csv
/project/data/.ipynb_checkpoints/dataset-checkpoint.txt

##### Read train.csv file

In [3]:
train_data = pd.read_csv("/project/data/train.csv")
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### Read test.csv file

In [4]:
#read test.csv file
test_data = pd.read_csv("/project/data/test.csv")
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# Data Preprocessing

#### Data Exploration

In [5]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### Get data in the "Survived" column seperate by Sex column.

In [6]:
female = train_data.loc[train_data.Sex == 'female']["Survived"]
male = train_data.loc[train_data.Sex == 'male']["Survived"]

In [7]:
rate_female = np.average(female)
print("% of female who survived:", rate_female)

% of female who survived: 0.7420382165605095

In [8]:
rate_male = np.average(male)
print("% of male who survived:", rate_male)

% of male who survived: 0.18890814558058924

## Modeling by random forest calssifier with features Pclass,Sex,SibSp,Parch

In [9]:
from sklearn.svm import SVC, LinearSVC

In [10]:
features = ["Pclass", "Sex", "SibSp", "Parch"]

In [11]:
Y = train_data["Survived"]
X = pd.get_dummies(train_data[features])
X_test = pd.get_dummies(test_data[features])

In [12]:
Y.head(10)

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

In [13]:
X.head(10)

   Pclass  SibSp  Parch  Sex_female  Sex_male
0       3      1      0           0         1
1       1      1      0           1         0
2       3      0      0           1         0
3       1      1      0           1         0
4       3      0      0           0         1
5       3      0      0           0         1
6       1      0      0           0         1
7       3      3      1           0         1
8       3      0      2           1         0
9       2      1      0           1         0

In [14]:
X_test.head(10)

   Pclass  SibSp  Parch  Sex_female  Sex_male
0       3      0      0           0         1
1       3      1      0           1         0
2       2      0      0           0         1
3       3      0      0           0         1
4       3      1      1           1         0
5       3      0      0           0         1
6       3      0      0           1         0
7       2      1      1           0         1
8       3      0      0           1         0
9       3      2      0           0         1

In [15]:
model = SVC()
model.fit(X, Y)
predictions = model.predict(X_test)

In [16]:
output = pd.DataFrame({'PassengerId': test_data.PassengerId, 'Survived': predictions})

In [17]:
output.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [62]:
output.to_csv('submission-solution-1.csv', index=False)
print("Submission was successfully saved!")

Submission was successfully saved!